<a href="https://colab.research.google.com/github/Song-eungi/python_base/blob/main/221104_pandas_%EA%B5%90%EC%9E%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from pandas import Series, DataFrame
import pandas as pd

In [ ]:
print("ver = ", pd.__version__)

ver =  1.4.4

1. Series 데이터 생성

In [ ]:
# Series 생성 1
fruit = Series(data=[2500,3800,1200,6000])
fruit

0    2500
1    3800
2    1200
3    6000
dtype: int64

In [ ]:
fruit = Series(data=[2500,3800,1200,6000],
               index=["ap","ba","pe","ch"])
fruit

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64

In [ ]:
fruit.values

array([2500, 3800, 1200, 6000], dtype=int64)

In [ ]:
fruit.index

Index(['ap', 'ba', 'pe', 'ch'], dtype='object')

In [ ]:
# Series 생성 2

data = {"ap":2500, "ba":3800, "pe":1200, "ch":6000};data

{'ap': 2500, 'ba': 3800, 'pe': 1200, 'ch': 6000}

In [ ]:
fruit = Series(data)
fruit

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64

In [ ]:
type(data)

dict

In [ ]:
type(fruit)

pandas.core.series.Series

In [ ]:
fruit

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64

In [ ]:
# Series 이름 붙이기
fruit.name = "fruitPrice"
fruit

ap    2500
ba    3800
pe    1200
ch    6000
Name: fruitPrice, dtype: int64

In [ ]:
fruit.index.name = "fruitName"
fruit

fruitName
ap    2500
ba    3800
pe    1200
ch    6000
Name: fruitPrice, dtype: int64

In [ ]:
fruit.index.name

'fruitName'

In [ ]:
Series()

In [ ]:
### 참고 
a = [1,2,3,4]
a

[1, 2, 3, 4]

In [ ]:
b = a;
b

[1, 2, 3, 4]

In [ ]:
b[1] = 999

In [ ]:
b

[1, 999, 3, 4]

In [ ]:
a

[1, 999, 3, 4]

In [ ]:
c = a.copy()

In [ ]:
c[1] = 999
c

[1, 999, 3, 4]

In [ ]:
a

[1, 2, 3, 4]

2. DataFrame 생성

In [ ]:
data = {"name":["ap","ba","ch","pe"],
        "price":[2500,3800,6000,1200],
        "num":[10,5,3,8]}
data

{'name': ['ap', 'ba', 'ch', 'pe'],
 'price': [2500, 3800, 6000, 1200],
 'num': [10, 5, 3, 8]}

In [ ]:
df = DataFrame(data)
df

  name  price  num
0   ap   2500   10
1   ba   3800    5
2   ch   6000    3
3   pe   1200    8

In [ ]:
df = DataFrame(data, columns=["price","num11","name"])
df

   price num11 name
0   2500   NaN   ap
1   3800   NaN   ba
2   6000   NaN   ch
3   1200   NaN   pe

In [ ]:
df = DataFrame(data, columns=["price","num","name"])
df

   price  num name
0   2500   10   ap
1   3800    5   ba
2   6000    3   ch
3   1200    8   pe

In [ ]:
# 특정 항목 추출 
df["name"]

0    ap
1    ba
2    ch
3    pe
Name: name, dtype: object

In [ ]:
df.name

0    ap
1    ba
2    ch
3    pe
Name: name, dtype: object

In [ ]:
df.name1

AttributeError: 'DataFrame' object has no attribute 'name1'

In [ ]:
# 컬럼 추가 
df["year"] = 2022
df

   price  num name  year
0   2500   10   ap  2022
1   3800    5   ba  2022
2   6000    3   ch  2022
3   1200    8   pe  2022

In [ ]:
variable = Series([4,2,1], index=[0,2,3])
variable

0    4
2    2
3    1
dtype: int64

In [ ]:
df["stock"] = variable
df

   price  num name  year  stock
0   2500   10   ap  2022    4.0
1   3800    5   ba  2022    NaN
2   6000    3   ch  2022    2.0
3   1200    8   pe  2022    1.0

In [ ]:
# 항목 삭제

In [ ]:
fruit = Series(data=[2500,3800,1200,6000],
               index=["ap","ba","pe","ch"])
fruit

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64

In [ ]:
fruit.drop("ba")

ap    2500
pe    1200
ch    6000
dtype: int64

In [ ]:
new_fruit = fruit.drop("ba")

In [ ]:
print(fruit)
print("-"*40)
print(new_fruit)

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64
----------------------------------------
ap    2500
pe    1200
ch    6000
dtype: int64

In [ ]:
# dataframe 삭제

In [ ]:
data = {"name":["ap","ba","ch","pe"],
        "price":[2500,3800,6000,1200],
        "num":[10,5,3,8]}

df = DataFrame(data, columns=["price","num","name"])
df

   price  num name
0   2500   10   ap
1   3800    5   ba
2   6000    3   ch
3   1200    8   pe

In [ ]:
data = {"name":["ap","ba","ch","pe"],
        "price":[2500,3800,6000,1200],
        "num":[10,5,3,8]}
name = data["name"]
df1 = DataFrame(data, index=name, columns=["price","num"])
df1

    price  num
ap   2500   10
ba   3800    5
ch   6000    3
pe   1200    8

In [ ]:
df2 = df1.drop(["ap","ch"])
df2

    price  num
ba   3800    5
pe   1200    8

In [ ]:
df1

    price  num
ap   2500   10
ba   3800    5
ch   6000    3
pe   1200    8

In [ ]:
df1.drop("num", axis=1)

    price
ap   2500
ba   3800
ch   6000
pe   1200

In [ ]:
df3 = df1.drop("num", axis=1)

In [ ]:
df3

    price
ap   2500
ba   3800
ch   6000
pe   1200

In [ ]:
df4 = df1.copy()

In [ ]:
df4.drop("num",axis=1, inplace=True)

In [ ]:
df4

    price
ap   2500
ba   3800
ch   6000
pe   1200

In [ ]:
# 항목 추출 slice

In [ ]:
fruit = Series(data=[2500,3800,1200,6000],
               index=["ap","ba","pe","ch"])
fruit

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64

In [ ]:
fruit["ap":"pe"]

ap    2500
ba    3800
pe    1200
dtype: int64

In [ ]:
data = {"name":["ap","ba","ch","pe"],
        "price":[2500,3800,6000,1200],
        "num":[10,5,3,8]}
name = data["name"]
df = DataFrame(data, index=name, columns=["price","num"])
df

    price  num
ap   2500   10
ba   3800    5
ch   6000    3
pe   1200    8

In [ ]:
df["price"]

ap    2500
ba    3800
ch    6000
pe    1200
Name: price, dtype: int64

In [ ]:
df["ap":"ba"]

    price  num
ap   2500   10
ba   3800    5

In [ ]:
# Series 연산

In [ ]:
fruit1 = Series(data=[5,9,10,3],
               index=["ap","ba","pe","ch"])
fruit2 = Series(data=[3,2,9,5,10],
               index=["ap","or","ba","ch","ma"])
print(fruit1)
print("-"*40)
print(fruit2)

ap     5
ba     9
pe    10
ch     3
dtype: int64
----------------------------------------
ap     3
or     2
ba     9
ch     5
ma    10
dtype: int64

In [ ]:
fruit1 + fruit2

ap     8.0
ba    18.0
ch     8.0
ma     NaN
or     NaN
pe     NaN
dtype: float64

In [ ]:
df1 = DataFrame({"oh":[4,8,3,5], "te":[0,1,2,3]},
                columns = ["oh","te"],
                index = ["ap","ba","ch","pe"]); print(df1)
print("-"*50)
df2 = DataFrame({"oh":[3,0,2,1,7], "co":[5,4,3,6,0]},
                columns = ["oh","co"],
                index = ["ap","or","ba","ch","ma"]); print(df2)

    oh  te
ap   4   0
ba   8   1
ch   3   2
pe   5   3
--------------------------------------------------
    oh  co
ap   3   5
or   0   4
ba   2   3
ch   1   6
ma   7   0

In [ ]:
df1 + df2

    co    oh  te
ap NaN   7.0 NaN
ba NaN  10.0 NaN
ch NaN   4.0 NaN
ma NaN   NaN NaN
or NaN   NaN NaN
pe NaN   NaN NaN

In [ ]:
# 정렬

In [ ]:
fruit

ap    2500
ba    3800
pe    1200
ch    6000
dtype: int64

In [ ]:
fruit.sort_values(ascending=False)

ch    6000
ba    3800
ap    2500
pe    1200
dtype: int64

In [ ]:
fruit.sort_index()

ap    2500
ba    3800
ch    6000
pe    1200
dtype: int64

In [ ]:
df.sort_index()

    price  num
ap   2500   10
ba   3800    5
ch   6000    3
pe   1200    8

In [ ]:
df.sort_index(axis=1)

    num  price
ap   10   2500
ba    5   3800
ch    3   6000
pe    8   1200

In [ ]:
df.sort_values(["price"])

    price  num
pe   1200    8
ap   2500   10
ba   3800    5
ch   6000    3